# IsShared Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..IsShared Property
Parameter Class See Also
---
Identifies if the parameter is a shared parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsShared { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsShared As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsShared {
	bool get ();
}
```

# See Also
Parameter Class
Autodesk.Revit.DB Namespace